-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Дек 10 2020 г., 17:04
-- Версия сервера: 5.7.29
-- Версия PHP: 7.4.5

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `newfilms`
--

-- --------------------------------------------------------

--
-- Структура таблицы `actors`
--

CREATE TABLE `actors` (
  `id_actor` int(4) NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `actors`
--

INSERT INTO `actors` (`id_actor`, `name`) VALUES
(1, 'Роберто Бениньи'),
(2, 'Кевин Спейси'),
(3, 'Джейми Прессли'),
(4, 'Аарон Пол'),
(5, 'Алан Рикман'),
(6, 'Алан Рикман'),
(7, 'Антон Ельчин'),
(8, 'Аманда Сайфред'),
(9, 'Арнольд Шварценеггер'),
(10, 'Адам Сэндлер'),
(11, 'Антонио Бандерас'),
(12, 'Анджелина Джоли'),
(13, 'Алан Форд'),
(14, 'Брэд Питт'),
(15, 'Бен Аффлек'),
(16, 'Бен Фостер'),
(17, 'Брук Шилдс'),
(18, 'Брэдли Купер'),
(19, 'Брайан О’Хэллоран'),
(20, 'Бенисио Дель Торо'),
(21, 'Брендан Глисон'),
(22, 'Брюс Уиллис'),
(23, 'Брендан Фрейзер'),
(24, 'Бенедикт Камбербэтч'),
(25, 'Винни Джонс'),
(26, 'Винсент Картайзер'),
(27, 'Гвинет Пэлтроу'),
(28, 'Генри Кавилл'),
(29, 'Галь Гадот'),
(30, 'Гарри Дин Стэнтон'),
(31, 'Даллас Робертс'),
(32, 'Доминик Купер'),
(33, 'Деннис Фарина'),
(34, 'Джон Фавро'),
(35, 'Дженнифер Швалбах Смит'),
(36, 'Дженнифер Гарнер'),
(37, 'Джастин Тимберлэйк'),
(38, 'Джет Ли'),
(39, 'DMX'),
(40, 'Джейден Смит'),
(41, 'Джон Легуизамо'),
(42, 'Джина Дэвис'),
(43, 'Даниэль Брюль'),
(44, 'Джордж Клуни'),
(45, 'Джейми Кэмпбелл Бауэр'),
(46, 'Джонни Депп'),
(47, 'Дайан Крюгер'),
(48, 'Дэвид Спейд'),
(49, 'Дэвид Морс'),
(50, 'Джонни Ноксвил'),
(51, 'Дольф Лундгрен'),
(52, 'Дэкс Шепард'),
(53, 'Дэнни Хьюстон'),
(54, 'Джон Ортис'),
(55, 'Джованни Рибизи'),
(56, 'Дж.К. Симмонс'),
(57, 'Дональд Сазерленд'),
(58, 'Джош Хартнетт'),
(59, 'Джон Туртурро'),
(60, 'Джефф Андерсон'),
(61, 'Джозеф Гордон-Левитт'),
(62, 'Джерард Батлер'),
(63, 'Джейсон Мьюз'),
(64, 'Джейсон Ли'),
(65, 'Дженнифер Лоуренс'),
(66, 'Джей Барушель'),
(67, 'Дрю Бэрримор'),
(68, 'Дэнни Трехо'),
(69, 'Джессика Альба'),
(70, 'Джаред Лето'),
(71, 'Джейсон Стэйтем'),
(72, 'Джейсон Флеминг'),
(73, 'Джеймс Франко'),
(74, 'Джон Траволта'),
(75, 'Джек Блэк'),
(76, 'Дастин Хоффман'),
(77, 'Джуно Темпл'),
(78, 'Джеймс Кэвизел'),
(79, 'Деми Мур'),
(80, 'Жан-Клод Ван Дамм'),
(81, 'Идрис Эльба'),
(82, 'Иэн МакКеллен'),
(83, 'Иэн МакШейн'),
(84, 'Клэр Форлани'),
(85, 'Колин Фаррелл'),
(86, 'Кевин Смит'),
(87, 'Крис Пайн'),
(88, 'Кристофер Аткинс'),
(89, 'Кирстен Данст'),
(90, 'Кэрри Кун'),
(91, 'Ким Диккенс'),
(92, 'Кевин Спейси'),
(93, 'Кристиан Бэйл'),
(94, 'Кристен Стюарт'),
(95, 'Карл Уэзерс'),
(96, 'Крис Хемсворт'),
(97, 'Кейт Бекинсейл'),
(98, 'Кристофер Уокен'),
(99, 'Кристен Белл'),
(100, 'Кевин Джеймс'),
(101, 'Карл Урбан'),
(102, 'Кэмерон Диаз'),
(103, 'Крис Рок'),
(104, 'Крис Пратт'),
(105, 'Крис Эванс'),
(106, 'Кен Ватанабе'),
(107, 'Киану Ривз'),
(108, 'Киллиан Мёрфи'),
(109, 'Квентин Тарантино'),
(110, 'Кристоф Вальц'),
(111, 'Лейтон Мистер'),
(112, 'Лесли Бибб'),
(113, 'Леди Гага'),
(114, 'Лиам Нисон'),
(115, 'Лиам Хемсворт'),
(116, 'Лоренс Фишбёрн'),
(117, 'Леонардо ДиКаприо'),
(118, 'Логан Лерман'),
(119, 'Лили Коллинз'),
(120, 'Леонард Нимой'),
(121, 'Линда Фиорентино'),
(122, 'Линдси Лохан'),
(123, 'Мелисса Джордж'),
(124, 'Майкл Кларк Дункан'),
(125, 'Мила Кунис'),
(126, 'Малин Акерман'),
(127, 'Меган Фокс'),
(128, 'Морган Фриман'),
(129, 'Мэтт Дэймон'),
(130, 'Марк Уолберг'),
(131, 'Мишель Родригес'),
(132, 'Мартин Фриман'),
(133, 'Майкл Фассбендер'),
(134, 'Мэттью МакКонахи'),
(135, 'Милла Йовович'),
(136, 'Моника Беллуччи'),
(137, 'Микки Рурк'),
(138, 'Мэл Гибсон'),
(139, 'Оливия Уайлд'),
(140, 'Пенелопа Крус'),
(141, 'Патрик Стюарт'),
(142, 'Патрик Суэйзи'),
(143, 'Пола Пэттон'),
(144, 'Пол Уокер'),
(145, 'Раде Шербеджия'),
(146, 'Розамунд Пайк'),
(147, 'Рассел Кроу'),
(148, 'Рэй Лиотта'),
(149, 'Розарио Доусон'),
(150, 'Рон Перлман'),
(151, 'Ричард Армитедж'),
(152, 'Роберт Дауни мл.'),
(153, 'Рэйчел Вайс'),
(154, 'Роб Шнайдер'),
(155, 'Родриго Санторо'),
(156, 'Рэйчел МакАдамс'),
(157, 'Роберт Де Ниро'),
(158, 'Стивен Сигал'),
(159, 'Сет Роген'),
(160, 'Саймон Пегг'),
(161, 'Сэмюэл Л. Джексон'),
(162, 'Стивен Грэм'),
(163, 'Сильвестр Сталлоне'),
(164, 'Скарлетт Йоханссон'),
(165, 'Сэм Уортингтон'),
(166, 'Сальма Хайек'),
(167, 'София Вергара'),
(168, 'Сигурни Уивер'),
(169, 'Томас Джейн'),
(170, 'Тейлор Китч'),
(171, 'Трэвис Фиммел'),
(172, 'Том Хэнкс'),
(173, 'Том Круз'),
(174, 'Том Харди'),
(175, 'Том Хиддлстон'),
(176, 'Тильда Суинтон'),
(177, 'Терренс Ховард'),
(178, 'Тим Аллен'),
(179, 'Уилл Феррелл'),
(180, 'Уилл Пэттон'),
(181, 'Фредди Родригес'),
(182, 'Фифти Сент'),
(183, 'Форест Уитакер'),
(184, 'Хью Джекман'),
(185, 'Хлоя Грейс Морец'),
(186, 'Харрисон Форд'),
(187, 'Хезер Уолкист'),
(188, 'Хейли Стайнфелд'),
(189, 'Харви Кейтель'),
(190, 'Хелена Бонем Картер'),
(191, 'Чич Марин'),
(192, 'Чак Норрис'),
(193, 'Чиветель Эджиофор'),
(194, 'Шеннон Элизабет'),
(195, 'Шарлиз Терон'),
(196, 'Шэннен Доэрти'),
(197, 'Шон Хэтоси'),
(198, 'Шэрон Стоун'),
(199, 'Эмма Уотсон'),
(200, 'Эмиль Хирш'),
(201, 'Эштон Кутчер'),
(202, 'Эмбер Хёрд'),
(203, 'Эдриан Броуди'),
(204, 'Энтони Хопкинс'),
(205, 'Эммануэль Шрики'),
(206, 'Энди Сэмберг'),
(207, 'Эдвард Нортон'),
(208, 'Эрик Бана'),
(209, 'Элиза Душку'),
(210, 'Эдди Марсан'),
(211, 'Энди Серкис'),
(212, 'Кейт Уинслет'),
(213, 'Лора Линни'),
(214, 'Николетта Браски');

-- --------------------------------------------------------

--
-- Структура таблицы `actors_films`
--

CREATE TABLE `actors_films` (
  `id` int(3) NOT NULL,
  `id_film` int(5) NOT NULL,
  `id_actor` int(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `actors_films`
--

INSERT INTO `actors_films` (`id`, `id_film`, `id_actor`) VALUES
(2, 1, 1),
(1, 2, 2),
(4, 3, 191),
(3, 2, 212),
(5, 2, 213),
(6, 1, 214);

-- --------------------------------------------------------

--
-- Структура таблицы `country`
--

CREATE TABLE `country` (
  `id_country` int(3) NOT NULL,
  `country` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `country`
--

INSERT INTO `country` (`id_country`, `country`) VALUES
(1, 'США'),
(2, 'Россия'),
(3, 'Китай'),
(4, 'Индия'),
(5, 'Австралия'),
(6, 'Бразилия'),
(7, 'Великобритания'),
(8, 'Венгрия'),
(9, 'Германия'),
(10, 'Гонконг'),
(11, 'Ирландия'),
(12, 'Испания'),
(13, 'Канада'),
(14, 'Мексика\r\n'),
(15, 'Новая Зеландия'),
(16, 'Норвегия\r\n'),
(17, 'СССР\r\n'),
(18, 'Франция'),
(19, 'Швейцария'),
(20, 'ЮАР'),
(21, 'Италия');

-- --------------------------------------------------------

--
-- Структура таблицы `films`
--

CREATE TABLE `films` (
  `id_film` int(5) NOT NULL,
  `name_ru` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name_en` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `year` year(4) DEFAULT NULL,
  `id_country` int(3) DEFAULT NULL,
  `id_genre` int(2) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `films`
--

INSERT INTO `films` (`id_film`, `name_ru`, `name_en`, `year`, `id_country`, `id_genre`) VALUES
(1, 'Жизнь прекрасна', 'La vita e bella', 1997, 21, 8),
(2, 'Жизнь Дэвида Гейла', 'The Life of David Gale', 2002, 1, 23),
(3, 'Король лев', 'The Lion King', 1994, 1, 17);

-- --------------------------------------------------------

--
-- Структура таблицы `genre`
--

CREATE TABLE `genre` (
  `id_genre` int(2) NOT NULL,
  `genre` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `genre`
--

INSERT INTO `genre` (`id_genre`, `genre`) VALUES
(5, 'биография'),
(6, 'боевик'),
(7, 'вестерн'),
(8, 'военный'),
(9, 'детектив'),
(10, 'документальный'),
(11, 'драма'),
(12, 'история'),
(13, 'комедия'),
(14, 'криминал'),
(15, 'мелодрама'),
(16, 'музыка'),
(17, 'мультфильм'),
(18, 'мюзикл'),
(19, 'приключения'),
(20, 'семейный'),
(21, 'сериал'),
(22, 'спорт'),
(23, 'триллер'),
(24, 'ужасы'),
(25, 'фантастика\r\n'),
(26, 'фэнтези');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `actors`
--
ALTER TABLE `actors`
  ADD PRIMARY KEY (`id_actor`);

--
-- Индексы таблицы `actors_films`
--
ALTER TABLE `actors_films`
  ADD PRIMARY KEY (`id`),
  ADD KEY `id_actor` (`id_actor`,`id_film`),
  ADD KEY `id_film` (`id_film`);

--
-- Индексы таблицы `country`
--
ALTER TABLE `country`
  ADD PRIMARY KEY (`id_country`);

--
-- Индексы таблицы `films`
--
ALTER TABLE `films`
  ADD PRIMARY KEY (`id_film`),
  ADD KEY `id_country` (`id_country`),
  ADD KEY `id_genre` (`id_genre`);

--
-- Индексы таблицы `genre`
--
ALTER TABLE `genre`
  ADD PRIMARY KEY (`id_genre`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `actors`
--
ALTER TABLE `actors`
  MODIFY `id_actor` int(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=215;

--
-- AUTO_INCREMENT для таблицы `actors_films`
--
ALTER TABLE `actors_films`
  MODIFY `id` int(3) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT для таблицы `country`
--
ALTER TABLE `country`
  MODIFY `id_country` int(3) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- AUTO_INCREMENT для таблицы `films`
--
ALTER TABLE `films`
  MODIFY `id_film` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `genre`
--
ALTER TABLE `genre`
  MODIFY `id_genre` int(2) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=27;

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `actors_films`
--
ALTER TABLE `actors_films`
  ADD CONSTRAINT `actors_films_ibfk_1` FOREIGN KEY (`id_actor`) REFERENCES `actors` (`id_actor`),
  ADD CONSTRAINT `actors_films_ibfk_2` FOREIGN KEY (`id_film`) REFERENCES `films` (`id_film`);

--
-- Ограничения внешнего ключа таблицы `films`
--
ALTER TABLE `films`
  ADD CONSTRAINT `films_ibfk_1` FOREIGN KEY (`id_country`) REFERENCES `country` (`id_country`),
  ADD CONSTRAINT `films_ibfk_2` FOREIGN KEY (`id_genre`) REFERENCES `genre` (`id_genre`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
